specs/qa/tiered-search-2026-08-18/k6-ramp-raw.txt
=== VUS=250 ===
    bar_profile_duration_ms........: avg=5.95ms  min=1.11ms   med=3.9ms   max=56.65ms p(90)=12.65ms p(95)=19.54ms
    catalog_duration_ms............: avg=4.13ms  min=336.67µs med=2.2ms   max=47.08ms p(90)=9.87ms  p(95)=17.3ms 
    commercial_write_duration_ms...: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s     
    featured_duration_ms...........: avg=4.05ms  min=370.72µs med=2.15ms  max=53.75ms p(90)=8.71ms  p(95)=16.42ms
    home_duration_ms...............: avg=15.29ms min=3.15ms   med=13.52ms max=43.75ms p(90)=25.91ms p(95)=27.51ms
    location_search_duration_ms....: avg=19.33ms min=834.31µs med=16.73ms max=75.32ms p(90)=29.22ms p(95)=36.21ms
    search_duration_ms.............: avg=9.52ms  min=495.34µs med=7.16ms  max=69.75ms p(90)=17.33ms p(95)=24.65ms
    waitlist_write_duration_ms.....: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s     

    HTTP
    http_req_duration..............: avg=10.09ms min=336.67µs med=7.08ms  max=92.6ms  p(90)=21.09ms p(95)=27.15ms
      { expected_response:true }...: avg=10.09ms min=336.67µs med=7.08ms  max=92.6ms  p(90)=21.09ms p(95)=27.15ms
    http_req_failed................: 0.00%  0 out of 22381
    http_reqs......................: 22381  185.120235/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=503.17ms med=1.01s   max=1.54s   p(90)=1.41s   p(95)=1.46s  
    iterations.....................: 22378  185.095421/s
    vus............................: 7      min=7          max=250
    vus_max........................: 250    min=250        max=250

    NETWORK
    data_received..................: 217 MB 1.8 MB/s
    data_sent......................: 30 MB  250 kB/s



running (2m00.9s), 000/250 VUs, 22378 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/250 VUs  2m0s
=== VUS=350 ===
    bar_profile_duration_ms........: avg=5.89ms  min=1.1ms    med=3.42ms  max=209.26ms p(90)=12ms    p(95)=17.87ms
    catalog_duration_ms............: avg=4.44ms  min=335.22µs med=1.94ms  max=217.88ms p(90)=8.91ms  p(95)=14.85ms
    commercial_write_duration_ms...: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
    featured_duration_ms...........: avg=4.12ms  min=296.47µs med=2.03ms  max=197.54ms p(90)=9.65ms  p(95)=15.01ms
    home_duration_ms...............: avg=12.58ms min=2.68ms   med=10.73ms max=110.84ms p(90)=23.75ms p(95)=28.2ms 
    location_search_duration_ms....: avg=19.18ms min=484.77µs med=16.54ms max=244.23ms p(90)=27.91ms p(95)=34.32ms
    search_duration_ms.............: avg=9.88ms  min=426.88µs med=6.94ms  max=243.54ms p(90)=17.36ms p(95)=24.17ms
    waitlist_write_duration_ms.....: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     

    HTTP
    http_req_duration..............: avg=10.14ms min=296.47µs med=6.8ms   max=244.23ms p(90)=20.15ms p(95)=26.58ms
      { expected_response:true }...: avg=10.14ms min=296.47µs med=6.8ms   max=244.23ms p(90)=20.15ms p(95)=26.58ms
    http_req_failed................: 0.00%  0 out of 31352
    http_reqs......................: 31352  259.643424/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=501.23ms med=1.01s   max=1.63s    p(90)=1.41s   p(95)=1.46s  
    iterations.....................: 31349  259.618579/s
    vus............................: 8      min=8          max=350
    vus_max........................: 350    min=350        max=350

    NETWORK
    data_received..................: 305 MB 2.5 MB/s
    data_sent......................: 42 MB  350 kB/s



running (2m00.8s), 000/350 VUs, 31349 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/350 VUs  2m0s
=== VUS=425 ===
    bar_profile_duration_ms........: avg=8.06ms  min=1.07ms   med=3.45ms  max=539.37ms p(90)=13.59ms p(95)=20.39ms
    catalog_duration_ms............: avg=6ms     min=338.6µs  med=1.97ms  max=524.75ms p(90)=10.61ms p(95)=16.6ms 
    commercial_write_duration_ms...: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
    featured_duration_ms...........: avg=7.25ms  min=352.35µs med=1.95ms  max=539.1ms  p(90)=11.38ms p(95)=17.88ms
    home_duration_ms...............: avg=12.32ms min=3.85ms   med=10.89ms max=270.26ms p(90)=20.89ms p(95)=26.3ms 
    location_search_duration_ms....: avg=21.75ms min=477.91µs med=16.32ms max=559.61ms p(90)=28.45ms p(95)=36.22ms
    search_duration_ms.............: avg=12.18ms min=357.98µs med=6.94ms  max=550.74ms p(90)=18.16ms p(95)=26.28ms
    waitlist_write_duration_ms.....: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     

    HTTP
    http_req_duration..............: avg=12.42ms min=338.6µs  med=6.94ms  max=559.61ms p(90)=20.69ms p(95)=28.03ms
      { expected_response:true }...: avg=12.42ms min=338.6µs  med=6.94ms  max=559.61ms p(90)=20.69ms p(95)=28.03ms
    http_req_failed................: 0.00%  0 out of 38008
    http_reqs......................: 38008  315.143739/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=502.15ms med=1.01s   max=1.99s    p(90)=1.41s   p(95)=1.46s  
    iterations.....................: 38005  315.118864/s
    vus............................: 13     min=13         max=425
    vus_max........................: 425    min=425        max=425

    NETWORK
    data_received..................: 367 MB 3.0 MB/s
    data_sent......................: 52 MB  427 kB/s



running (2m00.6s), 000/425 VUs, 38005 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/425 VUs  2m0s
=== VUS=500 ===
    bar_profile_duration_ms........: avg=21.24ms min=1.07ms   med=3.93ms  max=853.2ms  p(90)=25.16ms p(95)=44.79ms
    catalog_duration_ms............: avg=20.61ms min=343.77µs med=2.51ms  max=862.93ms p(90)=21.66ms p(95)=39.04ms
    commercial_write_duration_ms...: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
    featured_duration_ms...........: avg=17.25ms min=325.26µs med=2.4ms   max=857.25ms p(90)=19.91ms p(95)=35.46ms
    home_duration_ms...............: avg=19.76ms min=5.89ms   med=13.12ms max=496.76ms p(90)=25.55ms p(95)=33.16ms
    location_search_duration_ms....: avg=36.83ms min=484.02µs med=18.23ms max=870.62ms p(90)=41.72ms p(95)=62.76ms
    search_duration_ms.............: avg=26.91ms min=431.77µs med=8.05ms  max=874.2ms  p(90)=31.09ms p(95)=50.65ms
    waitlist_write_duration_ms.....: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     

    HTTP
    http_req_duration..............: avg=26.09ms min=325.26µs med=9.06ms  max=874.2ms  p(90)=31.73ms p(95)=49.97ms
      { expected_response:true }...: avg=26.09ms min=325.26µs med=9.06ms  max=874.2ms  p(90)=31.73ms p(95)=49.97ms
    http_req_failed................: 0.00%  0 out of 44098
    http_reqs......................: 44098  364.475268/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=502.16ms med=1.02s   max=2.33s    p(90)=1.42s   p(95)=1.47s  
    iterations.....................: 44095  364.450473/s
    vus............................: 1      min=1          max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 429 MB 3.5 MB/s
    data_sent......................: 59 MB  490 kB/s



running (2m01.0s), 000/500 VUs, 44095 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  2m0s
=== VUS=600 ===
    catalog_duration_ms............: avg=210.62ms min=306.83µs med=14.91ms max=1.51s    p(90)=837.87ms p(95)=991.61ms
    commercial_write_duration_ms...: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
    featured_duration_ms...........: avg=207.38ms min=364.12µs med=14.39ms max=1.48s    p(90)=825.68ms p(95)=998.81ms
    home_duration_ms...............: avg=108.05ms min=8.09ms   med=20.84ms max=800.48ms p(90)=418.56ms p(95)=537.81ms
    location_search_duration_ms....: avg=295.01ms min=639.99µs med=39.89ms max=1.61s    p(90)=1.04s    p(95)=1.18s   
    search_duration_ms.............: avg=278.15ms min=548.82µs med=29.01ms max=1.62s    p(90)=1.02s    p(95)=1.15s   
    waitlist_write_duration_ms.....: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      

    HTTP
    http_req_duration..............: avg=258.7ms  min=306.83µs med=27.3ms  max=1.62s    p(90)=975.82ms p(95)=1.13s   
      { expected_response:true }...: avg=258.7ms  min=306.83µs med=27.3ms  max=1.62s    p(90)=975.82ms p(95)=1.13s   
    http_req_failed................: 0.00%  0 out of 43284
    http_reqs......................: 43284  356.936382/s

    EXECUTION
    iteration_duration.............: avg=1.25s    min=503.02ms med=1.19s   max=3.06s    p(90)=2s       p(95)=2.25s   
    iterations.....................: 43281  356.911643/s
    vus............................: 1      min=1          max=600
    vus_max........................: 600    min=600        max=600

    NETWORK
    data_received..................: 418 MB 3.4 MB/s
    data_sent......................: 59 MB  483 kB/s



running (2m01.3s), 000/600 VUs, 43281 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/600 VUs  2m0s
time="2026-08-18T20:05:23Z" level=error msg="thresholds on metrics 'bar_profile_duration_ms, location_search_duration_ms, search_duration_ms' have been crossed"

[exited with code 0]